In [1]:
import pandas as pd
import numpy as np

In [2]:
data={"Names":['Ram','Laxman',np.nan,'Sita'],
     
     "Ages":[np.nan,23,22,21],
     "City":["Hyd","Blr","pune",np.nan]}
df=pd.DataFrame(data)

In [3]:
df.shape

(4, 3)

In [4]:
df

    Names  Ages  City
0     Ram   NaN   Hyd
1  Laxman  23.0   Blr
2     NaN  22.0  pune
3    Sita  21.0   NaN

In [5]:
df.isnull()

   Names   Ages   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [6]:
df.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

# method 1

In [7]:
#fill with random value

In [8]:
df.fillna(40,inplace=True)

In [9]:
df

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  pune
3    Sita  21.0    40

In [10]:
df

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  pune
3    Sita  21.0    40

# method2

In [11]:
df['Ages'].fillna('20')

0    40.0
1    23.0
2    22.0
3    21.0
Name: Ages, dtype: float64

In [12]:
df.dtypes

Names     object
Ages     float64
City      object
dtype: object

In [13]:
df["Names"].fillna("ravi",inplace=True)
df["City"].fillna("vijayawada",inplace=True)

In [14]:
df

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  pune
3    Sita  21.0    40

In [15]:
 df.fillna(method='pad')

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  pune
3    Sita  21.0    40

In [16]:
 df.fillna(method='backfill')

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  pune
3    Sita  21.0    40

$method-4$:

 **fill the missing values using axis**

In [17]:
df.fillna(method='pad',axis=1)

    Names  Ages  City
0     Ram  40.0   Hyd
1  Laxman  23.0   Blr
2      40  22.0  pune
3    Sita  21.0    40

In [18]:
#$method-5$
**Random
pad
bfill
mean-mode-meadian**

SyntaxError: invalid syntax (736529649.py, line 2)

In [ ]:
data={"Names":['Ram','Laxman',np.nan,'Sita'],
     
     "Ages":[np.nan,23,22,21],
     "City":["Hyd","Blr","pune",np.nan]}
df=pd.DataFrame(data)

In [ ]:
mean_age=df['Ages'].mean()

In [ ]:
mean_age

In [ ]:
df['Ages'].fillna(mean_age)

In [ ]:
meadian_age=df["Ages"].median()

In [ ]:
meadian_age

In [ ]:
df["Ages"].fillna(meadian_age)

# Dealing outliers

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
file_name="D:\\datasets\\archive (2)\\Car Sales.xlsx - car_data.csv"

In [ ]:
car_ds=pd.read_csv(file_name)

In [ ]:
car_ds.head()

In [ ]:
data=car_ds['Company']

In [ ]:
data

In [ ]:
plt.boxplot(data,vert=False)
plt.show()

In [ ]:
q1=round(np.quantile(data,0,25),2)
q2=round(np.quantile(data,0,50),2)
q3=round(np.quantile(data,0,75),2)
IQR=(q3-31)
LB=q1-1.5*IQR
UB=q3+1.5*IQR
con1=data<LB
con2=data>UB
con1|con2
outliers_data=car_ds[con1|con2]